app/controllers/bookings_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "bookings" ("booked_event_id", "event_attendee_id", "attending", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["booked_event_id", 2], ["event_attendee_id", 2], ["attending", 1], ["created_at", "2020-01-19 22:28:43.606803"], ["updated_at", "2020-01-19 22:28:43.606803"]]
---
  def create
    event = Event.find(params[:booked_event_id])
    current_user.bookings.create(booked_event_id: event.id, attending: true)