app/controllers/bookings_controller.rb

UPDATE "bookings" SET "attending" = ?, "updated_at" = ? WHERE "bookings"."id" = ?  [["attending", 1], ["updated_at", "2020-01-20 17:47:45.495267"], ["id", 5]]
---
  def create
    # current_user.bookings.create(booked_event_id: , attending: true)
    @event = Event.find_by(id: params[:booked_event_id])
    current_user.attended_events << @event
    # rubocop:disable Metrics/LineLength
    current_user.bookings.where('booked_event_id = ?', params[:booked_event_id]).first.update_attributes(attending: true)