app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT "events".* FROM "events" WHERE (date > '2020-01-20')

  def create
    @event = current_user.created_events.build(event_params)
    if @event.save
---
INSERT INTO "events" ("title", "description", "date", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?, ?)

  def show
    @event = Event.find_by(id: params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]